[Spec_Operative X2SoldierClassTemplate]

DisplayName="特战特工"
ClassSummary="特战特工是一名多面手士兵，可根据需求进行专精：使用猎人步枪精准清除关键目标；使用小精灵扰乱敌方行动；或接受军官训练指挥小队并提供掩护。无论扮演何种角色，只要特战特工在场，战局尽在掌控。"

LeftAbilityTreeTitle="精准打击"
RightAbilityTreeTitle="专家"
AbilityTreeTitles[0]="精准打击"
AbilityTreeTitles[1]="专家"
AbilityTreeTitles[2]="战场指挥官"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

[SpecOps_CombatScanner X2AbilityTemplate]
LocFriendlyName="特战扫描仪"
LocHelpText="派小精灵扫描指定区域，揭示所有敌人并对其施加全息瞄准效果。"
LocLongDescription="提供战斗扫描仪能力（若尚未拥有）。升级战斗扫描仪，使其不再结束回合。"
LocPromotionPopupText="<Bullet/> 派小精灵扫描指定区域，揭示所有敌人并对其施加全息瞄准效果。<br/><Bullet/> 可用于揭示隐藏单位。<br/><Bullet/> 攻击目标敌人时提供 <Ability:HOLOTARGETAIMBONUS/> 命中加成。<br/><Bullet/> 冷却时间 <class'MitzrutiPerkPack.MZCombatScanner'.default.Ability:CombatScanner_Cooldown/> 回合。<br/><Bullet/> 特战版战斗扫描仪可在不结束回合的情况下使用，但作用半径略有减小。"


[Asclepius_Reactor X2AbilityTemplate]
LocFriendlyName="阿斯克勒庇俄斯反应堆"
LocHelpText="该小精灵经改装扩展了支援模组，可执行医疗协议、复活协议和援助协议。"
LocLongDescription="该小精灵经改装扩展了支援模组，可执行医疗协议、复活协议和援助协议。"
LocPromotionPopupText="<Bullet/> 提供医疗协议、复活协议和援助协议。<br/>"

[AgonyGasProtocol X2AbilityTemplate]
LocFriendlyName="剧痛毒气协议"
LocHelpText="派遣 小精灵 向敌人喷洒剧痛毒气，施加剧痛、中毒状态并造成必定命中的伤害。"
LocLongDescription="派遣 小精灵 向敌人喷洒剧痛毒气，施加剧痛、中毒状态并造成必定命中的伤害。"
LocPromotionPopupText="<Bullet/> 冷却时间 <Ability:SELFCOOLDOWN/> 回合。<br/><Bullet/> 虽然剧痛毒气协议伤害低于毒素协议，但剧痛效果会提升目标所受所有持续伤害，对承受多种持续伤害状态的目标使用效果拔群。<br/><Bullet/> 需要有目标视野。"
